<!-- add-pr-comment:add-pr-comment -->

## Terraform Plan
### Environment: main
### Region: us-east-1
***Author***: `sakshiad` ***Action***: `pull_request`
***Working Directory***: `.`
***Workflow***: `Terraform - validation`
Please review below Terraform plan before accepting merge request:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-default"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-default"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-default"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-default"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-default"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-default"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[2] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-private-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public-us-east-2a"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public-us-east-2b"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.103.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc-public-us-east-2c"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all                             = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_vpn_gateway.this[0] will be created
+   resource "aws_vpn_gateway" "this" {
+       amazon_side_asn = "64512"
+       arn             = (known after apply)
+       id              = (known after apply)
+       tags            = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       tags_all        = {
+           "Environment" = "dev"
+           "FinOps"      = "true"
+           "Name"        = "halo-custom-vpc"
+           "Owner"       = "DevOps-Sakshi"
+           "Terraform"   = "true"
        }
+       vpc_id          = (known after apply)
    }

Plan: 32 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```